# В фермерском хозяйстве в Карелии выращивают чернику.
# Она растёт на круглой грядке, причём кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора
# на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

bushes = int(input('Введите количество кустов: '))
lst = list()
for i in range(bushes):
    crop = int(input('Введите урожайность: '))
    lst.append(crop)

berries = list()
for i in range(len(lst) - 1):
    berries.append(lst[i - 1] + lst[i] + lst[i + 1])
berries.append(lst[-2] + lst[-1] + lst[0])
print(f'Максимальное число ягод: {max(berries)}')
